tiborsimon/embedded-tdd-headers/pic/pic18/pic18c242_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18C242_H_
#define _PIC18C242_H_

#define PORTA                         0
#define AN0                           1
#define ULPWUIN                       2
#define PORTA_RA0                     3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define VREFM                         8
#define AN3                           9
#define PORTA_RA3                     10
#define VREFP                         11
#define PORTA_RA4                     12
#define T0CKI                         13
#define AN4                           14
#define PORTA_RA5                     15
#define LVDIN                         16
#define SS                            17
#define CLKOUT                        18
#define CLKO                          19
#define PORTA_RA6                     20
#define OSC2                          21
#define PORTB                         22
#define PORTB_RB0                     23
#define INT0                          24
#define PORTB_RB1                     25
#define INT1                          26
#define INT2                          27
#define PORTB_RB2                     28
#define CCP2_PA2                      29
#define PORTB_CCP2                    30
#define CCP2A                         31
#define PORTB_RB3                     32
#define PORTB_RB4                     33
#define PORTB_RB5                     34
#define PORTB_RB6                     35
#define PORTB_RB7                     36
#define PORTC                         37
#define T1CKI                         38
#define T1OSO                         39
#define PORTC_RC0                     40
#define PORTC_CCP2                    41
#define T1OSI                         42
#define PA2                           43
#define PORTC_RC1                     44
#define CCP1                          45
#define PA1                           46
#define PORTC_RC2                     47
#define SCL                           48
#define SCK                           49
#define PORTC_RC3                     50
#define SDA                           51
#define SDI                           52
#define PORTC_RC4                     53
#define SDO                           54
#define PORTC_RC5                     55
#define TX                            56
#define CK                            57
#define PORTC_RC6                     58
#define DT                            59
#define RX                            60
#define PORTC_RC7                     61
#define LATA                          62
#define LATA0                         63
#define LA0                           64
#define LATA1                         65
#define LA1                           66
#define LATA2                         67
#define LA2                           68
#define LATA3                         69
#define LA3                           70
#define LATA4                         71
#define LA4                           72
#define LATA5                         73
#define LA5                           74
#define LATA6                         75
#define LA6                           76
#define LATB                          77
#define LB0                           78
#define LATB0                         79
#define LB1                           80
#define LATB1                         81
#define LB2                           82
#define LATB2                         83
#define LB3                           84
#define LATB3                         85
#define LB4                           86
#define LATB4                         87
#define LB5                           88
#define LATB5                         89
#define LB6                           90
#define LATB6                         91
#define LB7                           92
#define LATB7                         93
#define LATC                          94
#define LATC0                         95
#define LC0                           96
#define LATC1                         97
#define LC1                           98
#define LATC2                         99
#define LC2                           100
#define LATC3                         101
#define LC3                           102
#define LATC4                         103
#define LC4                           104
#define LATC5                         105
#define LC5                           106
#define LATC6                         107
#define LC6                           108
#define LATC7                         109
#define LC7                           110
#define TRISA                         111
#define TRISA_RA0                     112
#define TRISA0                        113
#define TRISA_RA1                     114
#define TRISA1                        115
#define TRISA2                        116
#define TRISA_RA2                     117
#define TRISA_RA3                     118
#define TRISA3                        119
#define TRISA_RA4                     120
#define TRISA4                        121
#define TRISA_RA5                     122
#define TRISA5                        123
#define TRISA_RA6                     124
#define TRISA6                        125
#define TRISB                         126
#define TRISB_RB0                     127
#define TRISB0                        128
#define TRISB_RB1                     129
#define TRISB1                        130
#define TRISB_RB2                     131
#define TRISB2                        132
#define TRISB_RB3                     133
#define TRISB3                        134
#define TRISB_RB4                     135
#define TRISB4                        136
#define TRISB_RB5                     137
#define TRISB5                        138
#define TRISB_RB6                     139
#define TRISB6                        140
#define TRISB_RB7                     141
#define TRISB7                        142
#define TRISC                         143
#define TRISC0                        144
#define TRISC_RC0                     145
#define TRISC1                        146
#define TRISC_RC1                     147
#define TRISC2                        148
#define TRISC_RC2                     149
#define TRISC3                        150
#define TRISC_RC3                     151
#define TRISC4                        152
#define TRISC_RC4                     153
#define TRISC5                        154
#define TRISC_RC5                     155
#define TRISC6                        156
#define TRISC_RC6                     157
#define TRISC7                        158
#define TRISC_RC7                     159
#define PIE1                          160
#define TMR1IE                        161
#define TMR2IE                        162
#define CCP1IE                        163
#define SSPIE                         164
#define TXIE                          165
#define TX1IE                         166
#define RCIE                          167
#define RC1IE                         168
#define ADIE                          169
#define PIR1                          170
#define TMR1IF                        171
#define TMR2IF                        172
#define CCP1IF                        173
#define SSPIF                         174
#define TXIF                          175
#define TX1IF                         176
#define RCIF                          177
#define RC1IF                         178
#define ADIF                          179
#define IPR1                          180
#define TMR1IP                        181
#define TMR2IP                        182
#define CCP1IP                        183
#define SSPIP                         184
#define TX1IP                         185
#define TXIP                          186
#define RC1IP                         187
#define RCIP                          188
#define ADIP                          189
#define PIE2                          190
#define CCP2IE                        191
#define TMR3IE                        192
#define LVDIE                         193
#define BCLIE                         194
#define PIR2                          195
#define CCP2IF                        196
#define TMR3IF                        197
#define LVDIF                         198
#define BCLIF                         199
#define IPR2                          200
#define CCP2IP                        201
#define TMR3IP                        202
#define LVDIP                         203
#define BCLIP                         204
#define RCSTA                         205
#define RCD8                          206
#define RX9D                          207
#define OERR                          208
#define FERR                          209
#define ADDEN                         210
#define CREN                          211
#define SREN                          212
#define SRENA                         213
#define RC8_9                         214
#define RC9                           215
#define RX9                           216
#define nRC8                          217
#define NOT_RC8                       218
#define SPEN                          219
#define TXSTA                         220
#define TXD8                          221
#define TX9D1                         222
#define TX9D                          223
#define TRMT                          224
#define TRMT1                         225
#define BRGH1                         226
#define BRGH                          227
#define SYNC                          228
#define SYNC1                         229
#define TXEN1                         230
#define TXEN                          231
#define TX91                          232
#define TX8_9                         233
#define TX9                           234
#define NOT_TX8                       235
#define nTX8                          236
#define CSRC1                         237
#define CSRC                          238
#define T3CON                         239
#define TMR3ON                        240
#define TMR3CS                        241
#define nT3SYNC                       242
#define NOT_T3SYNC                    243
#define T3SYNC                        244
#define T3INSYNC                      245
#define SOSCEN3                       246
#define T3CCP1                        247
#define T3CKPS                        248
#define T3CKPS0                       249
#define T3CKPS1                       250
#define T3CCP2                        251
#define T3CON_RD16                    252
#define RD163                         253
#define T3RD16                        254
#define CCP2CON                       255
#define CCP2M                         256
#define CCP2M0                        257
#define CCP2M1                        258
#define CCP2M2                        259
#define CCP2M3                        260
#define DC2B0                         261
#define CCP2Y                         262
#define DC2B                          263
#define DC2B1                         264
#define CCP2X                         265
#define CCP1CON                       266
#define CCP1M0                        267
#define CCP1M                         268
#define CCP1M1                        269
#define CCP1M2                        270
#define CCP1M3                        271
#define CCP1Y                         272
#define DC1B                          273
#define DC1B0                         274
#define CCP1X                         275
#define DC1B1                         276
#define ADCON1                        277
#define PCFG0                         278
#define PCFG                          279
#define PCFG1                         280
#define PCFG2                         281
#define CHSN3                         282
#define PCFG3                         283
#define ADCS2                         284
#define ADFM                          285
#define ADCON0                        286
#define ADON                          287
#define nDONE                         288
#define GO_nDONE                      289
#define GO_DONE                       290
#define NOT_DONE                      291
#define GODONE                        292
#define DONE                          293
#define GO                            294
#define GO_NOT_DONE                   295
#define CHS                           296
#define CHS0                          297
#define CHS1                          298
#define CHS2                          299
#define ADCS                          300
#define ADCS0                         301
#define ADCAL                         302
#define ADCS1                         303
#define SSPCON2                       304
#define SEN                           305
#define RSEN                          306
#define PEN                           307
#define RCEN                          308
#define ACKEN                         309
#define ACKDT                         310
#define ACKSTAT                       311
#define GCEN                          312
#define SSPCON1                       313
#define SSPM0                         314
#define SSPM                          315
#define SSPM1                         316
#define SSPM2                         317
#define SSPM3                         318
#define CKP                           319
#define SSPEN                         320
#define SSPOV                         321
#define WCOL                          322
#define SSPSTAT                       323
#define BF                            324
#define UA                            325
#define R_NOT_W                       326
#define READ_WRITE                    327
#define NOT_W                         328
#define R_W                           329
#define RW                            330
#define R                             331
#define NOT_WRITE                     332
#define nW                            333
#define nWRITE                        334
#define R_nW                          335
#define I2C_READ                      336
#define START                         337
#define S                             338
#define I2C_START                     339
#define STOP                          340
#define I2C_STOP                      341
#define P                             342
#define NOT_A                         343
#define I2C_DATA                      344
#define nA                            345
#define D_nA                          346
#define D                             347
#define DA                            348
#define DATA_ADDRESS                  349
#define D_A                           350
#define D_NOT_A                       351
#define NOT_ADDRESS                   352
#define nADDRESS                      353
#define I2C_DAT                       354
#define CKE                           355
#define SMP                           356
#define T2CON                         357
#define T2CKPS0                       358
#define T2CKPS                        359
#define T2CKPS1                       360
#define TMR2ON                        361
#define TOUTPS0                       362
#define TOUTPS                        363
#define TOUTPS1                       364
#define TOUTPS2                       365
#define TOUTPS3                       366
#define PR2                           367
#define WM0                           368
#define WM1                           369
#define WAIT0                         370
#define WAIT1                         371
#define EBDIS                         372
#define T1CON                         373
#define TMR1ON                        374
#define TMR1CS                        375
#define NOT_T1SYNC                    376
#define T1SYNC                        377
#define nT1SYNC                       378
#define T1INSYNC                      379
#define T1OSCEN                       380
#define SOSCEN                        381
#define T1CKPS0                       382
#define T1CKPS                        383
#define T1CKPS1                       384
#define T1RD16                        385
#define T1CON_RD16                    386
#define RCON                          387
#define BOR                           388
#define NOT_BOR                       389
#define nBOR                          390
#define POR                           391
#define nPOR                          392
#define NOT_POR                       393
#define nPD                           394
#define NOT_PD                        395
#define PD                            396
#define TO                            397
#define NOT_TO                        398
#define nTO                           399
#define nRI                           400
#define NOT_RI                        401
#define RI                            402
#define LWRT                          403
#define IPEN                          404
#define WDTCON                        405
#define SWDTE                         406
#define SWDTEN                        407
#define LVDCON                        408
#define LVV0                          409
#define LVDL0                         410
#define LVDL                          411
#define LVV1                          412
#define LVDL1                         413
#define LVV2                          414
#define LVDL2                         415
#define LVV3                          416
#define LVDL3                         417
#define LVDEN                         418
#define BGST                          419
#define IRVST                         420
#define OSCCON                        421
#define SCS                           422
#define T0CON                         423
#define T0PS                          424
#define T0PS0                         425
#define T0PS1                         426
#define T0PS2                         427
#define PSA                           428
#define T0SE                          429
#define T0CS                          430
#define T08BIT                        431
#define TMR0ON                        432
#define STATUS                        433
#define C                             434
#define CARRY                         435
#define DC                            436
#define ZERO                          437
#define Z                             438
#define OV                            439
#define OVERFLOW                      440
#define N                             441
#define NEGATIVE                      442
#define INTCON3                       443
#define INT1IF                        444
#define INT1F                         445
#define INT2IF                        446
#define INT2F                         447
#define INT1E                         448
#define INT1IE                        449
#define INT2IE                        450
#define INT2E                         451
#define INT1P                         452
#define INT1IP                        453
#define INT2IP                        454
#define INT2P                         455
#define INTCON2                       456
#define RBIP                          457
#define TMR0IP                        458
#define T0IP                          459
#define INTEDG2                       460
#define INTEDG1                       461
#define INTEDG0                       462
#define RBPU                          463
#define NOT_RBPU                      464
#define nRBPU                         465
#define INTCON                        466
#define RBIF                          467
#define INT0F                         468
#define INT0IF                        469
#define T0IF                          470
#define TMR0IF                        471
#define RBIE                          472
#define INT0E                         473
#define INT0IE                        474
#define T0IE                          475
#define TMR0IE                        476
#define PEIE                          477
#define PEIE_GIEL                     478
#define GIEL                          479
#define GIE_GIEH                      480
#define GIE                           481
#define GIEH                          482
#define STKPTR0                       483
#define STKPTR                        484
#define SP0                           485
#define STKPTR1                       486
#define SP1                           487
#define STKPTR2                       488
#define SP2                           489
#define SP3                           490
#define STKPTR3                       491
#define STKPTR4                       492
#define SP4                           493
#define STKUNF                        494
#define STKOVF                        495
#define STKFUL                        496

#endif // _PIC18C242_H_
